{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_0", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "data0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution0_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution0", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "64", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm0_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm0_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm0_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm0_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm0", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation0", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_1", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution1_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution1", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "128", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm1_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm1_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm1_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm1_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm1", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_2", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution2_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution2", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "256", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm2_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm2_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm2_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm2_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm2", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation2", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_3", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 1], [29, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution3_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution3_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution3", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "256", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm3_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm3_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm3_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm3_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm3", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation3", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_4", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 1], [37, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution4_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution4_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution4", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "512", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm4_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm4_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm4_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm4_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm4", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation4", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_5", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution5_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution5_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution5", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "512", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm5_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm5_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm5_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm5_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm5", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation5", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_6", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution6_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution6_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution6", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "512", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm6_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm6_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm6_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm6_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm6", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation6", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_7", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 1], [59, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_6_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution7_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution7_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution7", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "512", 
                "pad": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm7_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm7_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm7_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm7_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm7", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation7", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling0", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[62, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_8", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 0], [68, 0, 1], [69, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution8_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution8_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution8", 
              "attrs": {
                "kernel": "(1, 1)", 
                "num_filter": "128", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm8_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm8_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm8_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm8_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm8", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation8", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_9", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_8_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution9_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution9_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution9", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "128", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm9_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm9_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm9_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm9_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm9", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation9", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling1", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[78, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_10", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution10_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution10_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution10", 
              "attrs": {
                "kernel": "(1, 1)", 
                "num_filter": "64", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm10_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm10_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm10_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm10_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm10", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation10", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution11_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_11", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_10_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution11_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution11_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution11", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "64", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm11_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm11_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm11_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm11_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm11", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation11", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling2", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[94, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution12_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_12", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution12_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution12_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution12", 
              "attrs": {
                "kernel": "(1, 1)", 
                "num_filter": "64", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm12_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm12_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm12_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm12_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm12", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation12", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution13_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_13", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_12_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution13_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution13_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution13", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "32", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm13_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm13_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm13_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm13_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm13", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation13", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution14_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "sg_mkldnn_conv_bn_relu_14", 
      "attrs": {
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_13_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution14_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "convolution14_bias0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution14", 
              "attrs": {
                "kernel": "(3, 3)", 
                "num_filter": "64", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "batchnorm14_gamma0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm14_beta0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm14_moving_mean0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "batchnorm14_moving_var0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm14", 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation14", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution15_bias", 
      "attrs": {
