{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "data_quantize", 
      "attrs": {
        "max_calib_range": "255.000000", 
        "min_calib_range": "0.000000", 
        "out_type": "uint8"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "attrs": {"__shape__": "(64, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "0_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "1_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "2_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "3_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "4_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_0", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1], [1, 1, 0], [1, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "data0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "softmax_label0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "0_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution0", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "3_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "4_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm0", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation0", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0], [8, 1, 0], [8, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "5_weight", 
      "attrs": {"__shape__": "(128, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "6_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "7_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "8_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "9_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "10_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_1", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1], [9, 1, 0], [9, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "5_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "6_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution1", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "7_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "8_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "9_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "10_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm1", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pooling1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[16, 0, 0], [16, 1, 0], [16, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "11_weight", 
      "attrs": {"__shape__": "(256, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "12_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "13_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "14_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "15_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "16_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_2", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1], [17, 1, 0], [17, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "11_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "12_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution2", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "13_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "14_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "15_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "16_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm2", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation2", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "17_weight", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "18_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "19_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "20_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "21_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "22_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_3", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1], [24, 1, 0], [24, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "17_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "18_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution3", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "256", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "19_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "20_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "21_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "22_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm3", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation3", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pooling2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[31, 0, 0], [31, 1, 0], [31, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "23_weight", 
      "attrs": {"__shape__": "(512, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "24_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "25_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "26_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "27_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "28_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_4", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1], [32, 1, 0], [32, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "23_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "24_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution4", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "25_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "26_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "27_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "28_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm4", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation4", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "29_weight", 
      "attrs": {"__shape__": "(512, 512, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "30_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "31_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "32_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "33_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "34_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_5", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1], [39, 1, 0], [39, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_4_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "29_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "30_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution5", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "31_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "32_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "33_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "34_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm5", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation5", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pooling3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[46, 0, 0], [46, 1, 0], [46, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "35_weight", 
      "attrs": {"__shape__": "(512, 512, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "36_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "37_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "38_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "39_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "40_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_6", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1], [47, 1, 0], [47, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pooling3_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "35_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "36_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution6", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "37_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "38_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "39_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "40_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm6", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation6", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "41_weight", 
      "attrs": {"__shape__": "(512, 512, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "42_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "43_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "44_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "45_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "46_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_7", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 1], [60, 0, 1], [54, 1, 0], [54, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_6_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "41_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "42_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution7", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "512", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "43_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "44_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "45_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "46_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm7", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation7", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_quantized_pooling", 
      "name": "quantized_pooling4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[61, 0, 0], [61, 1, 0], [61, 2, 0]]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "pooling4_dequantize", 
      "inputs": [[62, 0, 0], [62, 1, 0], [62, 2, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling0", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "upsampling0_output_quantize", 
      "attrs": {
        "max_calib_range": "0.000000", 
        "min_calib_range": "0.000000", 
        "out_type": "uint8"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_concat", 
      "name": "quantized_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[65, 0, 0], [47, 0, 0], [65, 1, 0], [65, 2, 0], [47, 1, 0], [47, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "47_weight", 
      "attrs": {"__shape__": "(128, 1024, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "48_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "49_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "50_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "51_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "52_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_8", 
      "attrs": {
        "max_calib_range": "0.025370", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1], [66, 1, 0], [66, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "47_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "48_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution8", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "no_bias": "False", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "49_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "50_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "51_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "52_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm8", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation8", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "53_weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "54_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "55_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "56_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "57_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "58_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_9", 
      "attrs": {
        "max_calib_range": "0.024652", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 1], [79, 0, 1], [73, 1, 0], [73, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_8_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "53_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "54_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution9", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "128", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "55_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "56_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "57_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "58_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm9", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation9", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "sg_mkldnn_conv_bn_relu_9_dequantize", 
      "inputs": [[80, 0, 0], [80, 1, 0], [80, 2, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling1", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "upsampling1_output_quantize", 
      "attrs": {
        "max_calib_range": "0.024652", 
        "min_calib_range": "0.000000", 
        "out_type": "uint8"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_concat", 
      "name": "quantized_concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[83, 0, 0], [32, 0, 0], [83, 1, 0], [83, 2, 0], [32, 1, 0], [32, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "59_weight", 
      "attrs": {"__shape__": "(64, 384, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "60_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "61_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "62_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "63_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "64_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_10", 
      "attrs": {
        "max_calib_range": "0.045330", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1], [84, 1, 0], [84, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "59_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "60_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution10", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "61_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "62_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "63_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "64_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm10", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation10", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "65_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "66_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "67_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "68_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "69_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "70_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_11", 
      "attrs": {
        "max_calib_range": "0.037707", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 0], [96, 0, 1], [97, 0, 1], [91, 1, 0], [91, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_conv_bn_relu_10_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "65_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "66_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution11", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(3, 3)", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(1, 1)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "67_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "68_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "69_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "70_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm11", 
              "attrs": {
                "cudnn_off": "1", 
                "eps": "9.999999747378752e-06", 
                "fix_gamma": "False", 
                "momentum": "0.8999999761581421"
              }, 
              "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation11", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[8, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2, 4, 5, 6, 7], 
          "node_row_ptr": [
            0, 
            1, 
            2, 
            3, 
            4, 
            5, 
            6, 
            7, 
            8, 
            11, 
            12
          ], 
          "heads": [[9, 0, 0]]
        }
      ]
    }, 
    {
      "op": "_contrib_dequantize", 
      "name": "sg_mkldnn_conv_bn_relu_11_dequantize", 
      "inputs": [[98, 0, 0], [98, 1, 0], [98, 2, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling2", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "upsampling2_output_quantize", 
      "attrs": {
        "max_calib_range": "0.037707", 
        "min_calib_range": "0.000000", 
        "out_type": "uint8"
      }, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_concat", 
      "name": "quantized_concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[101, 0, 0], [17, 0, 0], [101, 1, 0], [101, 2, 0], [17, 1, 0], [17, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "71_weight", 
      "attrs": {"__shape__": "(64, 192, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "72_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "73_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "74_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "75_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "76_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_conv", 
      "name": "quantized_sg_mkldnn_conv_bn_relu_12", 
      "attrs": {
        "max_calib_range": "0.054462", 
        "min_calib_range": "0.000000", 
        "quantized": "true", 
        "with_bn": "true", 
        "with_relu": "true"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1], [102, 1, 0], [102, 2, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat2_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "71_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "72_weight0", 
              "inputs": []
            }, 
            {
              "op": "Convolution", 
              "name": "convolution12", 
              "attrs": {
                "dilate": "(1, 1)", 
                "kernel": "(1, 1)", 
                "no_bias": "False", 
                "num_filter": "64", 
                "num_group": "1", 
                "pad": "(0, 0)", 
                "stride": "(1, 1)"
              }, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "null", 
              "name": "73_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "74_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "75_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "76_weight0", 
              "inputs": []
            }, 
            {
              "op": "BatchNorm", 
              "name": "batchnorm12", 
              "attrs": {
                "cudnn_off": "1", 
