{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "attrs": {"__shape__": "(64, 3, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "0_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "1_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "2_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "3_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "4_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5_weight", 
      "attrs": {"__shape__": "(128, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "6_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "7_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "8_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "9_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "10_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 1], [17, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "11_weight", 
      "attrs": {"__shape__": "(256, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "12_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "13_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "14_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "15_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "16_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "17_weight", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "18_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "19_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "20_weight", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "21_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "22_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(256,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "23_weight", 
      "attrs": {"__shape__": "(512, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "24_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "25_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "26_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "27_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "28_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "29_weight", 
      "attrs": {"__shape__": "(512, 512, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "30_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "31_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "32_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "33_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "34_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "35_weight", 
      "attrs": {"__shape__": "(512, 512, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "36_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "37_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "38_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "39_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "40_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 1], [65, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "41_weight", 
      "attrs": {"__shape__": "(512, 512, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "42_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "43_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "44_weight", 
      "attrs": {"__shape__": "(512,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "45_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "46_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(512,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1, 1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling0", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[78, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "47_weight", 
      "attrs": {"__shape__": "(128, 1024, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "48_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "49_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "50_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "51_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "52_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "53_weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "54_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "55_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "56_weight", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "57_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "58_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(128,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 1], [95, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling1", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[98, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "59_weight", 
      "attrs": {"__shape__": "(64, 384, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "60_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "61_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "62_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "63_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "64_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0], [105, 0, 1], [106, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "65_weight", 
      "attrs": {"__shape__": "(64, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "66_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "67_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "68_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "69_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "70_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "UpSampling", 
      "name": "upsampling2", 
      "attrs": {
        "num_args": "1", 
        "sample_type": "nearest", 
        "scale": "2"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[118, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "71_weight", 
      "attrs": {"__shape__": "(64, 192, 1, 1)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "72_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "73_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "74_weight", 
      "attrs": {"__shape__": "(64,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "75_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "76_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(64,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "77_weight", 
      "attrs": {"__shape__": "(32, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "78_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "79_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "80_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "81_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(32,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "82_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(32,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "83_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "84_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "85_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "86_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "87_weight", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "__shape__": "(32,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "88_weight", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "__shape__": "(32,)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "attrs": {
        "cudnn_off": "1", 
        "eps": "9.999999747378752e-06", 
        "fix_gamma": "False", 
        "momentum": "0.8999999761581421"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 1], [144, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "89_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "90_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "91_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "92_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "93_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "94_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "95_weight", 
      "attrs": {"__shape__": "(2, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "96_weight", 
      "attrs": {"__shape__": "(2,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "2", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling5", 
      "attrs": {
        "kernel": "(256, 256)", 
        "pad": "(0, 0, 0, 0)", 
        "pool_type": "avg", 
        "stride": "(256, 256)"
      }, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "97_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "98_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[146, 0, 0], [163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "99_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "100_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "101_weight", 
      "attrs": {"__shape__": "(32, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "102_weight", 
      "attrs": {"__shape__": "(32,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "103_weight", 
      "attrs": {"__shape__": "(16, 32, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "104_weight", 
      "attrs": {"__shape__": "(16,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    11, 
    12, 
    14, 
    15, 
    16, 
    17, 
    21, 
    22, 
    24, 
    25, 
    26, 
    27, 
    30, 
    31, 
    33, 
    34, 
    35, 
    36, 
    40, 
    41, 
    43, 
    44, 
    45, 
    46, 
    49, 
    50, 
    52, 
    53, 
    54, 
    55, 
    59, 
    60, 
    62, 
    63, 
    64, 
    65, 
    68, 
    69, 
    71, 
    72, 
    73, 
    74, 
    80, 
    81, 
    83, 
    84, 
    85, 
    86, 
    89, 
    90, 
    92, 
    93, 
    94, 
    95, 
    100, 
    101, 
    103, 
    104, 
    105, 
    106, 
    109, 
    110, 
    112, 
    113, 
    114, 
    115, 
    120, 
    121, 
    123, 
    124, 
    125, 
    126, 
    129, 
    130, 
    132, 
    133, 
    134, 
    135, 
    138, 
    139, 
    141, 
    142, 
    143, 
    144, 
    147, 
    148, 
    151, 
    152, 
    155, 
    156, 
    159, 
    160, 
    163, 
    164, 
    167, 
    168, 
    171, 
    172, 
    175, 
    176
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    24, 
    25, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    72, 
    73, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    96, 
    97, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    202, 
    203, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    212, 
    213
  ], 
  "heads": [[162, 0, 0], [177, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}